## To predict whether they purchase or not based on their Age, Sex and Estiamted Salary by Social_Network_Ads.

### Decision Tree

In [1]:
# Library files Load
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [2]:
#Dataset load
data=pd.read_csv("Social_Network_Ads.csv")

In [3]:
data.shape

(400, 5)

In [4]:
data.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [5]:
data=pd.get_dummies(data,drop_first=True)

In [6]:
data.head()

    User ID  Age  EstimatedSalary  Purchased  Gender_Male
0  15624510   19            19000          0            1
1  15810944   35            20000          0            1
2  15668575   26            43000          0            0
3  15603246   27            57000          0            0
4  15804002   19            76000          0            1

In [7]:
data=data.drop("User ID",axis=1)

In [8]:
data.head()

   Age  EstimatedSalary  Purchased  Gender_Male
0   19            19000          0            1
1   35            20000          0            1
2   26            43000          0            0
3   27            57000          0            0
4   19            76000          0            1

In [9]:
data["Purchased"].value_counts()

0    257
1    143
Name: Purchased, dtype: int64

In [10]:
x=data[["Age","EstimatedSalary","Gender_Male"]]
y=data[["Purchased"]]

In [11]:
x.shape

(400, 3)

In [12]:
y

     Purchased
0            0
1            0
2            0
3            0
4            0
..         ...
395          1
396          1
397          1
398          0
399          1

[400 rows x 1 columns]

In [13]:
#Split into training set and test
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test= train_test_split(x,y,test_size=1/3,random_state=0)

In [14]:
import warnings
warnings.filterwarnings('ignore')

In [15]:
from sklearn.tree import DecisionTreeClassifier
Classifier = DecisionTreeClassifier(criterion = 'entropy',random_state = 0)
#regressor.fit(x_train, y_train.values.ravel())
Classifier.fit(x_train, y_train)

DecisionTreeClassifier(criterion='entropy', random_state=0)

In [16]:
y_pred = Classifier.predict(x_test)

In [17]:
from sklearn.metrics import confusion_matrix
cm = confusion_matrix(y_test,y_pred)

In [18]:
print(cm)

[[76  9]
 [ 8 41]]

In [19]:
from sklearn.metrics import classification_report
clf_report = classification_report(y_test,y_pred)

In [20]:
print(clf_report)

              precision    recall  f1-score   support

           0       0.90      0.89      0.90        85
           1       0.82      0.84      0.83        49

    accuracy                           0.87       134
   macro avg       0.86      0.87      0.86       134
weighted avg       0.87      0.87      0.87       134